parsing-tech-log/src/Catalogs/ИзвестныеСитуации/ИзвестныеСитуации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИзвестныеСитуации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Свойство</name>
    <type>
      <types>CatalogRef.Свойства</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантыЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вектор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТекстыВариантов</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вектор</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

parsing-tech-log/src/Catalogs/ИзвестныеСитуации/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	Объект.ХешЗначения = ПолучитьХешЗначения(Объект.Текст);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьХешЗначения(Строка)
	хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	хеширование.Добавить(Строка);
	Возврат Base64Строка(хеширование.ХешСумма);	
КонецФункции

&НаКлиенте
Процедура СобытияПоСитуации(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Свойство", Объект.Свойство);
	ПараметрыФормы.Вставить("ХешЗначения", Объект.ХешЗначения);
	ОткрытьФорму("Справочник.ИзвестныеСитуации.Форма.СобытияПоСитуации", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантыЗначенийПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.СтраницаВариантыЗначений.Видимость = Объект.ВариантыЗначений;
	Элементы.СтраницаОдиночноеЗначение.Видимость = НЕ Объект.ВариантыЗначений;
	
КонецПроцедуры
